#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
aws_vpc.fiap_burger_vpc: Refreshing state... [id=vpc-03575ef2e677bf93d]
aws_subnet.fiap_burger_subnet_1c: Refreshing state... [id=subnet-021c304c737078352]
aws_subnet.fiap_burger_subnet_1a: Refreshing state... [id=subnet-056d295683fb8eb3f]
aws_subnet.fiap_burger_subnet_1b: Refreshing state... [id=subnet-01a25310fea44989f]
aws_internet_gateway.igw: Refreshing state... [id=igw-008128f51a839854a]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0f6a53179833d5af7]
aws_eks_cluster.fiap_burger_eks: Refreshing state... [id=fiap-burger-k8s]
aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-0cef119669d38e1d3]
aws_route_table_association.public_c: Refreshing state... [id=rtbassoc-033eb4368a9064df4]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-04011a1001d6bb9f6]
aws_eks_node_group.fiap_burger_eks_node_group: Refreshing state... [id=fiap-burger-k8s:fiap-burger-k8s-nodegroup]
aws_eks_addon.coredns: Refreshing state... [id=fiap-burger-k8s:coredns]
aws_eks_addon.kubeproxy: Refreshing state... [id=fiap-burger-k8s:kube-proxy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.fiap_burger_eks_node_group must be replaced
-/+ resource "aws_eks_node_group" "fiap_burger_eks_node_group" {
      ~ arn                    = "arn:aws:eks:us-east-1:287574492696:nodegroup/fiap-burger-k8s/fiap-burger-k8s-nodegroup/d6c8f906-0615-6ad2-90a2-b8975c5d272e" -> (known after apply)
      ~ capacity_type          = "SPOT" -> "ON_DEMAND" # forces replacement
      ~ id                     = "fiap-burger-k8s:fiap-burger-k8s-nodegroup" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.30.2-20240904" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-fiap-burger-k8s-nodegroup-d6c8f906-0615-6ad2-90a2-b8975c5d272e"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "fiap-burger-k8s-nodegroup"
        }
      ~ version                = "1.30" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ update_config {
          + ami_type               = (known after apply)
          + arn                    = (known after apply)
          + capacity_type          = (known after apply)
          + cluster_name           = (known after apply)
          + disk_size              = (known after apply)
          + force_update_version   = (known after apply)
          + id                     = (known after apply)
          + instance_types         = (known after apply)
          + labels                 = (known after apply)
          + node_group_name        = (known after apply)
          + node_group_name_prefix = (known after apply)
          + node_role_arn          = (known after apply)
          + release_version        = (known after apply)
          + resources              = (known after apply)
          + status                 = (known after apply)
          + subnet_ids             = (known after apply)
          + tags                   = (known after apply)
          + tags_all               = (known after apply)
          + version                = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - Kubernetes Cluster`*